[{
    "id": 1,
    "nombre": "Desarrollo web frontend con HTML, CSS y JavaScript",
    "descripcion": "Aprende los fundamentos de la programación web en el lado del cliente con HTML, CSS y JavaScript. Crea diseños atractivos y desarrolla interactividad en tus páginas web.",
    "resumen": "Este curso te enseñará los conceptos básicos de HTML para estructurar el contenido, CSS para diseñar y dar estilo a tus páginas, y JavaScript para agregar interactividad y funcionalidad. Adquirirás las habilidades necesarias para crear sitios web atractivos y funcionales desde cero.",
    "precio": 30000,
    "img": "/frontend.jpeg",
    "cupos": 12,
    "category": "programacion",
    "tema1":"Introducción a HTML",
    "tema2":"Estilización con CSS",
    "tema3":"Fundamentos de JavaScript",
    "tema4":"Manipulación del DOM",
    "tema5":"Creación de sitios web responsivos"
  }, {
    "id": 2,
    "nombre": "Desarrollo web backend con Node.js",
    "descripcion": "Aprende a construir aplicaciones web en el lado del servidor utilizando Node.js. Adquiere conocimientos sobre la creación de APIs y el manejo de bases de datos.",
    "resumen":"Este curso te enseñará cómo utilizar Node.js para desarrollar aplicaciones web en el lado del servidor. Aprenderás a crear y gestionar APIs, interactuar con bases de datos, implementar autenticación y seguridad, y desplegar tus aplicaciones en entornos de producción.",
    "precio": 35000,
    "img": "/backend.jpeg",
    "cupos": 16,
    "category": "programacion",
    "tema1":"Introducción a Node.js",
    "tema2":"Creación de servidores con Express.js",
    "tema3":"Manejo de bases de datos con MongoDB",
    "tema4":"Autenticación y autorización de usuarios",
    "tema5":"Despliegue de aplicaciones en entornos de producción"
  }, {
    "id": 3,
    "nombre": "Programación orientada a objetos en Java",
    "descripcion": "Aprende los principios de la programación orientada a objetos utilizando el lenguaje Java. Adquiere conocimientos sobre clases, objetos, herencia y polimorfismo.",
    "resumen":"Este curso te guiará en el mundo de la programación orientada a objetos con Java. Aprenderás a diseñar y construir programas utilizando clases, objetos, herencia, polimorfismo y otros conceptos fundamentales de la POO.",
    "precio": 2000,
    "img": "/objetos.jpeg",
    "cupos": 9,
    "category": "programacion",
    "tema1":"Introducción a la programación orientada a objetos",
    "tema2":"Clases y objetos en Java",
    "tema3":"Herencia y polimorfismo",
    "tema4":"Abstracción y encapsulamiento",
    "tema5":"Manejo de excepciones en Java"
  }, {
    "id": 4,
    "nombre": "Desarrollo de aplicacion móviles con React Native",
    "descripcion": "Aprende a desarrollar aplicaciones móviles multiplataforma utilizando React Native. Crea aplicaciones nativas para iOS y Android con una única base de código.",
    "resumen": "En este curso aprenderás a utilizar React Native para crear aplicaciones móviles nativas utilizando JavaScript. Descubrirás cómo aprovechar la potencia de React y las capacidades nativas de los dispositivos para desarrollar aplicaciones de calidad para iOS y Android.",
    "precio": 45000,
    "img": "/appmoviles.jpeg",
    "cupos": 5,
    "category": "programacion",
    "tema1":"Introducción a React Native",
    "tema2":"Componentes y navegación",
    "tema3":"Acceso a APIs nativas",
    "tema4":"Gestión de estado con Redux",
    "tema5":"Despliegue de aplicaciones en tiendas de aplicaciones"
  }, {
    "id": 5,
    "nombre": "Desarrollo de videojuegos con Unity",
    "descripcion": "Sumérgete en el emocionante mundo del desarrollo de videojuegos utilizando Unity, uno de los motores más populares y versátiles de la industria. Aprende a crear tus propios juegos para diversas plataformas.",
    "resumen":"En este curso descubrirás los principios esenciales del desarrollo de videojuegos con Unity. Aprenderás a diseñar entornos, programar la lógica del juego, implementar mecánicas interactivas, trabajar con gráficos y audio, y optimizar tus juegos para diferentes dispositivos.",
    "precio": 50000,
    "img": "/videojuegos.jpeg",
    "cupos": 10,
    "category": "programacion",
    "tema1":"Introducción a Unity y su entorno de desarrollo",
    "tema2":"Diseño de entornos y niveles de juego",
    "tema3":"Programación de mecánicas y lógica del juego",
    "tema4":"Implementación de gráficos, audio y efectos especiales",
    "tema5":"Optimización y despliegue de juegos en diferentes plataformas"
  }, {
    "id": 6,
    "nombre": "Ciberseguridad para desarrolladores",
    "descripcion": "Adquiere conocimientos fundamentales sobre ciberseguridad para proteger tus aplicaciones y sistemas. Aprende a identificar vulnerabilidades, aplicar buenas prácticas de seguridad y responder a posibles ataques.",
    "resumen":" Este curso te brindará una comprensión sólida de los principios de ciberseguridad aplicados al desarrollo de software. Aprenderás sobre técnicas de hacking ético, seguridad de aplicaciones web, protección de datos, criptografía y gestión de incidentes.",
    "precio": 15000,
    "img": "/ciberseguridad.jpeg",
    "cupos": 2,
    "category": "programacion",
    "tema1":"Introducción a la ciberseguridad y amenazas comunes",
    "tema2":"Hacking ético y pruebas de penetración",
    "tema3":"Seguridad en aplicaciones web y APIs",
    "tema4":"Protección de datos y privacidad",
    "tema5":"Criptografía y gestión de incidentes de seguridad"
  }, {
    "id": 7,
    "nombre": "Aprendizaje automático con Python",
    "descripcion": "Aprende a desarrollar y entrenar modelos de aprendizaje automático utilizando Python, realizar análisis de datos y tomar decisiones basadas en algoritmos predictivos.",
    "resumen":"En este curso aprenderás los fundamentos del aprendizaje automático utilizando Python. Explorarás algoritmos de clasificación, regresión y agrupamiento, así como técnicas de preprocesamiento de datos y evaluación de modelos. Adquirirás las habilidades necesarias para aplicar el aprendizaje automático en diversas áreas.",
    "precio": 15000,
    "img": "/python.jpeg",
    "cupos": 18,
    "category": "programacion",
    "tema1":"Introducción al aprendizaje automático y sus aplicaciones",
    "tema2":"Preprocesamiento de datos: limpieza, transformación y selección de características",
    "tema3":"Algoritmos de aprendizaje supervisado: clasificación y regresión",
    "tema4":"Algoritmos de aprendizaje no supervisado",
    "tema5":"Evaluación de modelos y optimización de parámetros"
  }, {
    "id": 8,
    "nombre": "Inteligencia artificial",
    "descripcion": "Sumérgete en el campo de la Inteligencia Artificial y el Aprendizaje Automático. Aprende los conceptos fundamentales, las técnicas y las aplicaciones de la IA y el ML en diversos campos.",
    "resumen":" En este curso explorarás los principios y las técnicas de la Inteligencia Artificial y el Aprendizaje Automático. Aprenderás cómo aplicar algoritmos de ML para resolver problemas complejos, como reconocimiento de imágenes, procesamiento de lenguaje natural y toma de decisiones automatizada.",
    "precio": 40000,
    "img": "/inteligencia.jpeg",
    "cupos": 5,
    "category": "programacion",
    "tema1":"Introducción a la Inteligencia Artificial y el Aprendizaje Automático",
    "tema2":"Algoritmos de Aprendizaje Supervisado y No Supervisado",
    "tema3":"Redes Neuronales y Aprendizaje Profundo",
    "tema4":"Procesamiento de Lenguaje Natural",
    "tema5":"Aplicaciones de la Inteligencia Artificial en diversos campos"
  }, {
    "id": 9,
    "nombre": "Estrategias en redes sociales",
    "descripcion": "Descubre cómo aprovechar las redes sociales para impulsar el crecimiento de tu negocio. Aprende a crear estrategias efectivas de marketing en plataformas como Facebook, Instagram, Twitter y LinkedIn.",
    "resumen":"En este curso aprenderás las mejores prácticas y técnicas para desarrollar estrategias de marketing en redes sociales. Obtendrás conocimientos sobre segmentación de audiencia, creación de contenido atractivo, gestión de campañas publicitarias y análisis de resultados.",
    "precio": 12000,
    "img": "/redes.jpeg",
    "cupos": 25,
    "category": "marketing",
    "tema1":"Introducción al marketing en redes sociales",
    "tema2":"Identificación de objetivos y definición de la audiencia objetivo",
    "tema3":"Creación de contenido relevante y atractivo",
    "tema4":"Gestión de campañas publicitarias en redes sociales",
    "tema5":"Medición y análisis de resultados"
  }, {
    "id": 10,
    "nombre": "Publicidad en linea",
    "descripcion": " Aprende a utilizar la plataforma de publicidad en línea de Google para promocionar tu negocio. Descubre cómo crear anuncios efectivos, gestionar campañas y optimizar tus estrategias publicitarias.",
    "resumen":"En este curso aprenderás a utilizar Google Ads para crear anuncios en línea y alcanzar a tu audiencia objetivo. Explorarás las diferentes opciones de segmentación, estrategias de puja, formatos de anuncios y herramientas de optimización para maximizar el rendimiento de tus campañas.",
    "precio": 18000,
    "img": "/publicidad.jpeg",
    "cupos": 12,
    "category": "marketing",
    "tema1":"Introducción a Google Ads y la publicidad en línea",
    "tema2":"Configuración de campañas y selección de palabras clave",
    "tema3":"Creación de anuncios efectivos y formatos de anuncios",
    "tema4":"Estrategias de puja y optimización de campañas",
    "tema5":"Seguimiento y análisis de resultados en Google Ads"
  }, {
    "id": 11,
    "nombre": "Email marketing",
    "descripcion": "Descubre cómo utilizar el email marketing para alcanzar a tu audiencia de manera efectiva. Aprende a crear campañas de correo electrónico persuasivas, gestionar listas de suscriptores y medir el rendimiento de tus campañas.",
    "resumen":"En este curso aprenderás las mejores prácticas del email marketing. Explorarás cómo diseñar y enviar campañas de correo electrónico impactantes, utilizar estrategias de automatización, gestionar listas de suscriptores y realizar pruebas A/B para mejorar tus resultados.",
    "precio": 15000,
    "img": "/email.jpeg",
    "cupos": 30,
    "category": "marketing",
    "tema1":"Introducción al email marketing y su importancia",
    "tema2":"Diseño y creación de campañas de correo electrónico persuasivas",
    "tema3":"Segmentación y gestión de listas de suscriptores",
    "tema4":"Automatización de campañas y flujos de correo electrónico",
    "tema5":"Seguimiento y análisis de resultados en email marketing"
  }, {
    "id": 12,
    "nombre": "Posicionamiento en motores de búsqueda",
    "descripcion": "Aprende las técnicas y estrategias para mejorar el posicionamiento de tu sitio web en los motores de búsqueda. Descubre cómo optimizar el contenido, la estructura del sitio y el uso de palabras clave para obtener mayor visibilidad en Google y otros buscadores.",
    "resumen":"En este curso explorarás las mejores prácticas de SEO para mejorar la visibilidad de tu sitio web en los motores de búsqueda. Aprenderás a realizar análisis de palabras clave, optimizar el contenido, mejorar la estructura del sitio y generar enlaces de calidad para atraer tráfico orgánico.",
    "precio": 20000,
    "img": "/seo.jpeg",
    "cupos": 7,
    "category": "marketing",
    "tema1":"Introducción al SEO y su importancia",
    "tema2":"Investigación de palabras clave y análisis de competencia",
    "tema3":"Optimización del contenido y etiquetas HTML",
    "tema4":"Mejora de la estructura del sitio y la experiencia de usuario",
    "tema5":"Generación de enlaces de calidad y estrategias de link building"
  }, {
    "id": 13,
    "nombre": "Publicidad en buscadores",
    "descripcion": "Aprende a utilizar Google AdWords y otras plataformas de publicidad en buscadores para promocionar tu negocio. Descubre cómo crear campañas efectivas, seleccionar palabras clave relevantes y optimizar tu presupuesto publicitario.",
    "resumen":" En este curso aprenderás a utilizar Google AdWords y otras herramientas de publicidad en buscadores para alcanzar a tu audiencia de manera efectiva. Explorarás cómo configurar campañas publicitarias, seleccionar palabras clave relevantes, escribir anuncios persuasivos y medir el rendimiento de tus campañas.",
    "precio": 20000,
    "img": "/sem.jpeg",
    "cupos": 21,
    "category": "marketing",
    "tema1":"Introducción a la publicidad en buscadores y Google AdWords",
    "tema2":"Configuración de campañas y selección de palabras clave",
    "tema3":"Creación de anuncios efectivos y extensiones de anuncios",
    "tema4":"Optimización de campañas y estrategias de puja",
    "tema5":"Seguimiento y análisis de resultados en publicidad en buscadores"
  }, {
    "id": 14,
    "nombre": "Branding",
    "descripcion": " Descubre cómo construir una marca sólida y memorable. Aprende a desarrollar una identidad de marca, comunicar los valores y mensajes adecuados, y crear una conexión emocional con tu audiencia.",
    "resumen":"En este curso explorarás los fundamentos del branding y cómo construir una marca fuerte y coherente. Aprenderás a definir la identidad de marca, desarrollar estrategias de comunicación efectivas, crear una voz y tono distintivos, y construir una imagen de marca sólida.",
    "precio": 15000,
    "img": "/branding.jpeg",
    "cupos": 16,
    "category": "marketing",
    "tema1":"Introducción al branding y su importancia",
    "tema2":"Definición de la identidad de marca: propósito, valores y personalidad",
    "tema3":"Estrategias de comunicación y posicionamiento de marca",
    "tema4":"Diseño de elementos visuales de marca: logotipo, colores y tipografía",
    "tema5":"Construcción de una experiencia de marca coherente y memorable"
  }, {
    "id": 15,
    "nombre": "Diseño de experiencia de usuario (UX)" ,
    "descripcion": "Aprende los principios y técnicas para diseñar experiencias de usuario excepcionales. Descubre cómo investigar, diseñar y evaluar interfaces intuitivas y atractivas que cumplan con las necesidades y expectativas de los usuarios." ,
    "resumen":"En este curso explorarás los fundamentos del diseño de experiencia de usuario (UX). Aprenderás a realizar investigaciones de usuarios, crear wireframes y prototipos interactivos, y realizar pruebas de usabilidad. Mejorarás tus habilidades para diseñar interfaces intuitivas y agradables para los usuarios.",
    "precio": 20000,
    "img": "/ux.jpeg",
    "cupos": 25,
    "category": "diseño",
    "tema1":"Introducción al diseño de experiencia de usuario (UX) y su importancia",
    "tema2":"Investigación de usuarios y análisis de requerimientos",
    "tema3":"Diseño de arquitectura de información y creación de wireframes",
    "tema4":"Diseño de interfaces atractivas y usables",
    "tema5":"Evaluación y mejora continua de la experiencia de usuario"
    
  }, {
    "id": 16,
    "nombre": "Diseño de interfaces de usuario (UI)" ,
    "descripcion":"Aprende a diseñar interfaces de usuario atractivas y efectivas. Explora los principios de diseño visual, la tipografía, el uso del color y la disposición de elementos para crear interfaces agradables y funcionales.",
    "resumen":"En este curso te adentrarás en los aspectos visuales del diseño de interfaces de usuario (UI). Aprenderás sobre la importancia de la tipografía, el uso del color, la disposición de elementos y la creación de patrones visuales coherentes. Mejorarás tus habilidades para diseñar interfaces atractivas y efectivas.",
    "precio": 20000,
    "img": "/ui.jpeg",
    "cupos": 18,
    "category": "diseño",
    "tema1":"Introducción al diseño de interfaces de usuario (UI) y su importancia",
    "tema2":"Principios de diseño visual: tipografía, color y elementos gráficos",
    "tema3":"Diseño de patrones visuales y elementos de interacción",
    "tema4":"Diseño responsivo y adaptativo",
    "tema5":"Mejores prácticas de diseño de interfaces de usuario"
  }, {
    "id": 17,
    "nombre": "Adobe Photoshop",
    "descripcion": "Aprende a utilizar Adobe Photoshop, la herramienta líder en edición y manipulación de imágenes. Descubre las herramientas y técnicas básicas para retocar fotografías, crear composiciones y diseñar gráficos atractivos." ,
    "precio":12000,
    "img":"/photoshop.jpeg",
    "cupos":25,
    "category":"diseño",
    "tema1":"Introducción a Adobe Photoshop y su interfaz",
    "tema2":"Herramientas básicas de edición y retoque de imágenes",
    "tema3":"Trabajo con capas y ajustes de color",
    "tema4":"Creación de composiciones y montajes fotográficos",
    "tema5":"Aplicación de efectos y filtros creativos"
  }, {
    "id": 18,
    "nombre": "Adobe Illustrator",
    "descripcion": "Aprende a utilizar Adobe Illustrator, la herramienta líder en diseño vectorial. Descubre las herramientas y técnicas básicas para crear ilustraciones, logotipos y gráficos vectoriales de alta calidad.",
    "resumen":"En este curso aprenderás los fundamentos de Adobe Illustrator, desde la navegación por la interfaz hasta la creación de ilustraciones vectoriales. Dominarás las herramientas de dibujo, la manipulación de formas, el manejo de colores y la creación de efectos especiales.",
    "precio":12000,
    "img":"/illustrator.jpeg",
    "cupos":19,
    "category":"diseño",
    "tema1":"Introducción a Adobe Illustrator y su entorno de trabajo",
    "tema2":"Herramientas de dibujo y manipulación de formas",
    "tema3":"Trabajo con texto y tipografía",
    "tema4":"Manejo de colores y degradados",
    "tema5":"Creación de efectos y estilos especiales"
  }, {
    "id": 19,
    "nombre": "Creación de animaciones",
    "descripcion": "Aprende a crear animaciones profesionales con After Effects. Explora las herramientas y técnicas para dar vida a tus diseños, agregar efectos visuales y crear composiciones audiovisuales impactantes.",
    "resumen":"En este curso descubrirás las posibilidades creativas de After Effects. Aprenderás a utilizar las herramientas de animación, las capas de efectos, los ajustes de tiempo y las técnicas de composición para crear animaciones dinámicas y visualmente atractivas.",
    "precio":15000,
    "img":"/animaciones.jpeg",
    "cupos":12,
    "category":"diseño",
    "tema1":"Introducción a After Effects y su interfaz de usuario",
    "tema2":"Animación de propiedades y capas en After Effects",
    "tema3":"Uso de efectos visuales y transiciones",
    "tema4":"Composición de elementos y creación de secuencias",
    "tema5":"Exportación y renderizado de animaciones"
  }, {
    "id": 20,
    "nombre": "Diseño gráfico",
    "descripcion": "Domina las herramientas y técnicas avanzadas de diseño gráfico con CorelDRAW. Aprende a crear ilustraciones complejas, manipular imágenes, trabajar con texto y aplicar efectos especiales.",
    "resumen":"En este curso avanzado de CorelDRAW, profundizarás en el uso de las herramientas y funciones del programa. Dominarás las técnicas de diseño avanzadas, la manipulación de imágenes, la creación de composiciones complejas y la aplicación de efectos especiales.",
    "precio":17000,
    "img":"/grafico.jpeg",
    "cupos":1,
    "category":"diseño",
    "tema1":"Herramientas básicas y conceptos fundamentales de CorelDRAW",
    "tema2":"Diseño avanzado de ilustraciones y composiciones complejas",
    "tema3":"Manipulación de imágenes y retoque fotográfico en CorelDRAW",
    "tema4":"Uso de efectos especiales y estilos avanzados",
    "tema5":"Trabajo con texto y tipografía avanzada en CorelDRAW"
  }, {
    "id": 21,
    "nombre": "Inglés básico",
    "descripcion": "Aprende los conceptos y vocabulario básico del inglés técnico para comunicarte en entornos profesionales. Mejora tus habilidades de lectura, escritura, escucha y expresión oral en situaciones relacionadas con tu área de especialización.",
    "resumen":"En este curso adquirirás las bases del inglés técnico, incluyendo términos específicos, expresiones comunes y estructuras gramaticales utilizadas en tu campo profesional. Mejorarás tu capacidad para comprender y comunicarte de manera efectiva en entornos laborales.",
    "precio":10000,
    "img":"/ingles1.jpeg",
    "cupos":1,
    "category":"idiomas",
    "tema1":"Introducción al inglés técnico y vocabulario básico",
    "tema2":"Gramática y estructuras fundamentales en inglés técnico",
    "tema3":"Habilidades de lectura y comprensión de textos técnicos",
    "tema4":"Expresión oral en situaciones profesionales",
    "tema5":"Escritura de documentos técnicos simples"
  }, {
    "id": 22,
    "nombre": "Inglés intermedio",
    "descripcion": "Mejora tus habilidades de comunicación en inglés técnico a un nivel intermedio. Amplía tu vocabulario, perfecciona tu gramática y practica la comprensión auditiva y la expresión oral en situaciones profesionales.",
    "resumen":"En este curso fortalecerás tus habilidades de lectura, escritura y conversación en inglés técnico. Te familiarizarás con términos y expresiones más avanzadas utilizadas en tu área de especialización, y aprenderás a comunicarte con mayor fluidez y precisión.",
    "precio":12000,
    "img":"/ingles2.jpeg",
    "cupos":1,
    "category":"idiomas",
    "tema1":"Ampliación del vocabulario técnico y expresiones idiomáticas",
    "tema2":"Gramática avanzada para la comunicación técnica",
    "tema3":"Comprensión auditiva de discursos y presentaciones en inglés técnico",
    "tema4":"Conversaciones y negociaciones profesionales",
    "tema5":"Redacción de informes y documentos técnicos"
  }, {
    "id": 23,
    "nombre": "Inglés avanzado",
    "descripcion": "Domina el inglés técnico a un nivel avanzado y desarrolla una sólida competencia comunicativa en tu campo profesional. Amplía tu vocabulario especializado, mejora tu comprensión auditiva y perfecciona tus habilidades de escritura y expresión oral.",
    "resumen":" En este curso avanzado de inglés técnico, profundizarás en áreas específicas de tu campo profesional. Aprenderás a expresarte con precisión en discursos, presentaciones y escritos técnicos, y adquirirás fluidez en la comprensión de materiales especializados.",
    "precio":15000,
    "img":"/ingles3.jpeg",
    "cupos":1,
    "category":"idiomas",
    "tema1":"Terminología especializada en el campo profesional",
    "tema2":"Discursos y presentaciones técnicas avanzadas",
    "tema3":"Lectura y comprensión de textos especializados",
    "tema4":"Debate y argumentación en inglés técnico",
    "tema5":"Escritura académica y científica en inglés"
  }, {
    "id": 24,
    "nombre": "Japonés para principiantes",
    "descripcion": "Aprende los fundamentos del idioma japonés, incluyendo el vocabulario básico, la gramática elemental y las habilidades de lectura y escritura necesarias para comunicarte en situaciones cotidianas.",
    "resumen":"En este curso introductorio de japonés, adquirirás los conocimientos básicos para comunicarte en el idioma. Aprenderás expresiones comunes, el sistema de escritura hiragana y katakana, y las estructuras gramaticales fundamentales para establecer conversaciones simples en japonés.",
    "precio":13000,
    "img":"/japones.jpeg",
    "cupos":1,
    "category":"idiomas",
    "tema1":"Aprendizaje del alfabeto hiragana y katakana",
    "tema2":"Vocabulario básico y expresiones comunes en japonés",
    "tema3":"Gramática elemental y estructuras de oraciones simples",
    "tema4":"Conversaciones cotidianas y situaciones prácticas",
    "tema5":"Lectura y escritura de textos básicos en japonés"
  }, {
    "id": 25,
    "nombre": "Ruso para principiantes",
    "descripcion": "Descubre los fundamentos del idioma ruso, desde el vocabulario básico hasta la gramática elemental. Aprende a comunicarte en situaciones cotidianas, a leer y escribir en ruso, y a desarrollar una base sólida para futuros estudios del idioma.",
    "resumen":" En este curso de ruso básico, te familiarizarás con el alfabeto cirílico, aprenderás palabras y frases esenciales, y adquirirás habilidades básicas de conversación, lectura y escritura. Desarrollarás una comprensión general del idioma y estarás preparado para avanzar en tu aprendizaje.",
    "precio":13000,
    "img":"/ruso.jpeg",
    "cupos":1,
    "category":"idiomas",
    "tema1":"Alfabeto cirílico y pronunciación en ruso",
    "tema2":"Vocabulario básico y frases de uso frecuente",
    "tema3":"Gramática elemental y construcción de oraciones simples",
    "tema4":"Comunicación en situaciones cotidianas y sociales",
    "tema5":"Lectura y escritura básica en ruso"
  }, {
    "id": 26,
    "nombre": "Microsoft Office",
    "descripcion": "Aprende a utilizar las aplicaciones de Microsoft Office, como Word, Excel y PowerPoint, para mejorar tu productividad y comunicación en el entorno laboral.",
    "resumen":"En este curso de Microsoft Office, explorarás las principales herramientas y funciones de Word, Excel y PowerPoint. Aprenderás a crear y editar documentos de texto, realizar cálculos y análisis de datos, y diseñar presentaciones impactantes.",
    "precio":10000,
    "img":"/office.jpeg",
    "cupos":1,
    "category":"herramientas",
    "tema1":"Introducción a Microsoft Office",
    "tema2":"Procesador de texto con Word",
    "tema3":"Hojas de cálculo con Excel",
    "tema4":"Presentaciones impactantes con PowerPoint",
    "tema5":"Optimización de la productividad con Office"
  }, {
    "id": 27,
    "nombre": "GitHub",
    "descripcion": "Aprende a utilizar GitHub, una plataforma de control de versiones y colaboración, para gestionar tus proyectos de desarrollo de software y trabajar de manera eficiente en equipo.",
    "resumen":"En este curso de GitHub para principiantes, te familiarizarás con los conceptos básicos de control de versiones y aprenderás a utilizar GitHub para gestionar tus proyectos. Aprenderás a crear repositorios, realizar commits, manejar ramas, colaborar con otros desarrolladores mediante solicitudes de extracción y resolver conflictos.",
    "precio":8000,
    "img":"/github.jpeg",
    "cupos":5,
    "category":"herramientas",
    "tema1":"Introducción a Git y GitHub",
    "tema2":"Configuración de Git y GitHub",
    "tema3":"Gestión de repositorios",
    "tema4":"Ramas y colaboración",
    "tema5":"Flujo de trabajo con GitHub"
  }]